### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

# Read School and Student Data File and store into Pandas DataFrames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

# Combine the data into a single dataset.  
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])

## District Summary

* Calculate the total number of schools

* Calculate the total number of students

* Calculate the total budget

* Calculate the average math score 

* Calculate the average reading score

* Calculate the percentage of students with a passing math score (70 or greater)

* Calculate the percentage of students with a passing reading score (70 or greater)

* Calculate the percentage of students who passed math **and** reading (% Overall Passing)

* Create a dataframe to hold the above results

* Optional: give the displayed data cleaner formatting

In [2]:
#read and display dataset
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [3]:
#Calculate the total number of schools
school_name = school_data_complete['school_name'].unique()
total_school = len(school_name)

In [4]:
#Calculate the total number of students
total_student = school_data_complete['Student ID'].count()
total_student

39170

In [5]:
#Calculate the total budget
budget = school_data_complete.groupby('school_name').budget.mean().sum()
budget

24649428

In [6]:
#Calculate the average math score
avrg_math_score = school_data_complete['math_score'].mean()
avrg_math_score

78.98537145774827

In [7]:
#Calculate the average reading score
avrg_reading_score = school_data_complete['reading_score'].mean()
avrg_reading_score

81.87784018381414

In [8]:
#Calculate the percentage of students with a passing math score (70 or greater)
avrg_math_pass_total = school_data_complete.loc[school_data_complete['math_score']>=70,:].shape[0]
avrg_math_pass =avrg_math_pass_total/total_student
avrg_math_pass

0.749808526933878

In [9]:
#Calculate the percentage of students with a passing reading score (70 or greater)
avrg_read_pass_total = school_data_complete.loc[school_data_complete['reading_score']>=70,:].shape[0]
avrg_read_pass =avrg_read_pass_total/total_student
avrg_read_pass

0.8580546336482001

In [10]:
#Calculate the percentage of students who passed math **and** reading (% Overall Passing)
avrg_passall_total = school_data_complete.loc[(school_data_complete['math_score']>=70) & (school_data_complete['reading_score']>=70),:].shape[0]
avrg_passall =avrg_passall_total/total_student
avrg_passall

0.6517232575950983

In [11]:
#Create a dataframe to hold the above results
Summary_table = pd.DataFrame({'Total Schools':[total_school],
                              'Total Students':total_student,
                              'Total Budget':budget,
                              'Average Math Score':avrg_math_score,
                              'Average Reading Score':avrg_reading_score,
                              '% Passing Math':avrg_math_pass,
                              '% Passing Reading':avrg_read_pass,
                              '% Overall Passing':avrg_passall
                             })

In [12]:
#Give the displayed data cleaner formatting

In [13]:
Summary_table['Total Students'] = Summary_table['Total Students'].map('{:,}'.format)
Summary_table['Total Budget'] = Summary_table['Total Budget'].astype(float).map("${:,.2f}".format)
Summary_table['% Passing Math'] = Summary_table['% Passing Math'] *100
Summary_table['% Passing Reading'] = Summary_table['% Passing Reading'] *100
Summary_table['% Overall Passing'] = Summary_table['% Overall Passing'] *100

Summary_table

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",78.985371,81.87784,74.980853,85.805463,65.172326

## School Summary

* Create an overview table that summarizes key metrics about each school, including:
  * School Name
  * School Type
  * Total Students
  * Total School Budget
  * Per Student Budget
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * % Overall Passing (The percentage of students that passed math **and** reading.)
  
* Create a dataframe to hold the above results

In [14]:
#groupby name 
new_groupby_name = school_data_complete.groupby(['school_name']).mean()

In [15]:
#per student budget
new_groupby_name['Per Student Budget'] = new_groupby_name['budget']/new_groupby_name['size']

In [16]:
#Average Math Score
new_groupby_name['Average Math Score'] = new_groupby_name['math_score']

In [17]:
#Average Reading Score
new_groupby_name['Average Reading Score'] = new_groupby_name['reading_score']

In [18]:
# creating series and concat them

In [19]:
#type -series
new_type = school_data.set_index('school_name')['type']
new_type

school_name
Huang High School        District
Figueroa High School     District
Shelton High School       Charter
Hernandez High School    District
Griffin High School       Charter
Wilson High School        Charter
Cabrera High School       Charter
Bailey High School       District
Holden High School        Charter
Pena High School          Charter
Wright High School        Charter
Rodriguez High School    District
Johnson High School      District
Ford High School         District
Thomas High School        Charter
Name: type, dtype: object

In [20]:
#% Passing Math - series
total_passing_math_per_school = school_data_complete[school_data_complete.math_score>= 70].groupby(['school_name']).count() 
passing_math_per_school = total_passing_math_per_school['size'] /new_groupby_name['size'] 
passing_math_per_school

school_name
Bailey High School       0.666801
Cabrera High School      0.941335
Figueroa High School     0.659885
Ford High School         0.683096
Griffin High School      0.933924
Hernandez High School    0.667530
Holden High School       0.925059
Huang High School        0.656839
Johnson High School      0.660576
Pena High School         0.945946
Rodriguez High School    0.663666
Shelton High School      0.938671
Thomas High School       0.932722
Wilson High School       0.938677
Wright High School       0.933333
Name: size, dtype: float64

In [21]:
#% Passing reading - series
total_passing_reading_per_school = school_data_complete[school_data_complete.reading_score>= 70].groupby(['school_name']).count() 
passing_reading_per_school = total_passing_reading_per_school['size'] /new_groupby_name['size'] 
passing_reading_per_school

school_name
Bailey High School       0.819333
Cabrera High School      0.970398
Figueroa High School     0.807392
Ford High School         0.792990
Griffin High School      0.971390
Hernandez High School    0.808630
Holden High School       0.962529
Huang High School        0.813164
Johnson High School      0.812224
Pena High School         0.959459
Rodriguez High School    0.802201
Shelton High School      0.958546
Thomas High School       0.973089
Wilson High School       0.965396
Wright High School       0.966111
Name: size, dtype: float64

In [22]:
#overall_passing
total_passing_per_school = school_data_complete[(school_data_complete['math_score']>=70) & (school_data_complete['reading_score']>=70)].groupby(['school_name']).count()
overall_passing  = total_passing_per_school['size']/new_groupby_name['size']
overall_passing

school_name
Bailey High School       0.546423
Cabrera High School      0.913348
Figueroa High School     0.532045
Ford High School         0.542899
Griffin High School      0.905995
Hernandez High School    0.535275
Holden High School       0.892272
Huang High School        0.535139
Johnson High School      0.535392
Pena High School         0.905405
Rodriguez High School    0.529882
Shelton High School      0.898921
Thomas High School       0.909480
Wilson High School       0.905826
Wright High School       0.903333
Name: size, dtype: float64

In [23]:
# put them together - format
new_groupby_name['School Type'] = new_type
new_groupby_name['% Passing Math'] = passing_math_per_school *100
new_groupby_name['% Passing Reading'] = passing_reading_per_school *100
new_groupby_name['% Overall Passing'] = overall_passing *100
new_groupby_name['Total Students'] =new_groupby_name['size']
new_groupby_name['Total School Budget'] =new_groupby_name['budget']

In [24]:
#chart summary 
new_groupby_name = new_groupby_name[['School Type','Total Students','Total School Budget','Per Student Budget','Average Math Score','Average Reading Score','% Passing Math','% Passing Reading','% Overall Passing']]

In [25]:
#formatting
style_format = {'Total Students': '{:.0f}', 
                          'Total School Budget': '${:,.2f}', 
                          'Per Student Budget': '${:.2f}',
                          'Average Math Score': '{:.6f}', 
                          'Average Reading Score': '{:.6f}', 
                          '% Passing Math': '{:.6f}', 
                          '% Passing Reading': '{:.6f}', 
                          '% Overall Passing': '{:.6f}'}
new_format = new_groupby_name.style.format(style_format)

In [26]:
new_format

## Top Performing Schools (By % Overall Passing)

* Sort and display the top five performing schools by % overall passing.

In [27]:
#sorting with decending order
sort_top_overall = new_groupby_name.sort_values('% Overall Passing', ascending=False).head()
#formatting again
sort_top_overall.style.format(style_format)

## Bottom Performing Schools (By % Overall Passing)

* Sort and display the five worst-performing schools by % overall passing.

In [28]:
sort_top_overall = new_groupby_name.sort_values('% Overall Passing', ascending=True).head()
sort_top_overall.style.format(style_format)

## Math Scores by Grade

* Create a table that lists the average Reading Score for students of each grade level (9th, 10th, 11th, 12th) at each school.

  * Create a pandas series for each grade. Hint: use a conditional statement.
  
  * Group each series by school
  
  * Combine the series into a dataframe
  
  * Optional: give the displayed data cleaner formatting

In [29]:
# create series and concat them
nine =student_data.loc[student_data['grade'] == '9th',:].groupby(['school_name']).mean().math_score
ten = student_data.loc[student_data['grade'] == '10th',:].groupby(['school_name']).mean().math_score
eleven = student_data.loc[student_data['grade'] == '11th',:].groupby(['school_name']).mean().math_score
twelve = student_data.loc[student_data['grade'] == '12th',:].groupby(['school_name']).mean().math_score
#build data frame with series 
math_score_grade = pd.DataFrame({'9th':nine,'10th':ten,'11th':eleven,'12th':twelve})
math_score_grade

                             9th       10th       11th       12th
school_name
Bailey High School     77.083676  76.996772  77.515588  76.492218
Cabrera High School    83.094697  83.154506  82.765560  83.277487
Figueroa High School   76.403037  76.539974  76.884344  77.151369
Ford High School       77.361345  77.672316  76.918058  76.179963
Griffin High School    82.044010  84.229064  83.842105  83.356164
Hernandez High School  77.438495  77.337408  77.136029  77.186567
Holden High School     83.787402  83.429825  85.000000  82.855422
Huang High School      77.027251  75.908735  76.446602  77.225641
Johnson High School    77.187857  76.691117  77.491653  76.863248
Pena High School       83.625455  83.372000  84.328125  84.121547
Rodriguez High School  76.859966  76.612500  76.395626  77.690748
Shelton High School    83.420755  82.917411  83.383495  83.778976
Thomas High School     83.590022  83.087886  83.498795  83.497041
Wilson High School     83.085578  83.724422  83.195326  83.035794
Wright High School     83.264706  84.010288  83.836782  83.644986

## Reading Score by Grade

* Perform the same operations as above for reading scores

In [30]:
nine_read =student_data.loc[student_data['grade'] == '9th',:].groupby(['school_name']).mean().reading_score
ten_read = student_data.loc[student_data['grade'] == '10th',:].groupby(['school_name']).mean().reading_score
eleven_read = student_data.loc[student_data['grade'] == '11th',:].groupby(['school_name']).mean().reading_score
twelve_read = student_data.loc[student_data['grade'] == '12th',:].groupby(['school_name']).mean().reading_score

reading_score_grade = pd.DataFrame({'9th':nine_read,'10th':ten_read,'11th':eleven_read,'12th':twelve_read})
reading_score_grade

                             9th       10th       11th       12th
school_name
Bailey High School     81.303155  80.907183  80.945643  80.912451
Cabrera High School    83.676136  84.253219  83.788382  84.287958
Figueroa High School   81.198598  81.408912  80.640339  81.384863
Ford High School       80.632653  81.262712  80.403642  80.662338
Griffin High School    83.369193  83.706897  84.288089  84.013699
Hernandez High School  80.866860  80.660147  81.396140  80.857143
Holden High School     83.677165  83.324561  83.815534  84.698795
Huang High School      81.290284  81.512386  81.417476  80.305983
Johnson High School    81.260714  80.773431  80.616027  81.227564
Pena High School       83.807273  83.612000  84.335938  84.591160
Rodriguez High School  80.993127  80.629808  80.864811  80.376426
Shelton High School    84.122642  83.441964  84.373786  82.781671
Thomas High School     83.728850  84.254157  83.585542  83.831361
Wilson High School     83.939778  84.021452  83.764608  84.317673
Wright High School     83.833333  83.812757  84.156322  84.073171

## Scores by School Spending

* Create a table that breaks down school performances based on average Spending Ranges (Per Student). Use 4 reasonable bins to group school spending. Include in the table each of the following:
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * Overall Passing Rate (Average of the above two)

In [31]:
#make bin list and group name list
bins = [0,585,630,645,675]
group_name = ['<$584','$585-629','$630-644','$645-675']
#pick columns wantted to show
scores_by_spending = new_groupby_name[["Average Math Score",
                                    "Average Reading Score",
                                    "% Passing Math",
                                    "% Passing Reading",
                                    "% Overall Passing"]]
#binning function
scores_by_spending['Spending Ranges(Per Student)'] = pd.cut(new_groupby_name["Per Student Budget"],bins, labels = group_name, include_lowest = True )
#group by new index 
scores_by_spending  = scores_by_spending.groupby('Spending Ranges(Per Student)').mean()
#format table
spending_style_format = {'Average Math Score': '{:.2f}', 
                          'Average Reading Score': '{:.2f}', 
                          '% Passing Math': '{:.2f}', 
                          '% Passing Reading': '{:.2f}', 
                          '% Overall Passing': '{:.2f}'}
scores_by_spending.style.format(spending_style_format)

<ipython-input-31-8c9659233e81>:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  scores_by_spending['Spending Ranges(Per Student)'] = pd.cut(new_groupby_name["Per Student Budget"],bins, labels = group_name, include_lowest = True )

## Scores by School Size

* Perform the same operations as above, based on school size.

In [32]:
bins = [0,1000,2000,5000]
group_name = ['Small (<1000)','Medium (1000-2000)','Large (2000-5000)']
scores_by_size = new_groupby_name[["Average Math Score",
                                    "Average Reading Score",
                                    "% Passing Math",
                                    "% Passing Reading",
                                    "% Overall Passing"]]
scores_by_size['School Size'] = pd.cut(new_groupby_name["Total Students"],bins, labels = group_name, include_lowest = True )
scores_by_size  = scores_by_size.groupby('School Size').mean()

size_style_format = {'Average Math Score': '{:.6f}', 
                          'Average Reading Score': '{:.6f}', 
                          '% Passing Math': '{:.6f}', 
                          '% Passing Reading': '{:.6f}', 
                          '% Overall Passing': '{:.6f}'}
scores_by_size.style.format(size_style_format)

<ipython-input-32-893368f0e958>:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  scores_by_size['School Size'] = pd.cut(new_groupby_name["Total Students"],bins, labels = group_name, include_lowest = True )

## Scores by School Type

* Perform the same operations as above, based on school type

In [33]:
#simple group by type
scores_by_type = new_groupby_name[["School Type",
                                    "Average Math Score",
                                    "Average Reading Score",
                                    "% Passing Math",
                                    "% Passing Reading",
                                    "% Overall Passing"]]

scores_by_type  = scores_by_type.groupby('School Type')
scores_by_type.mean()

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Type,,,,,
Charter,83.473852,83.896421,93.620830,96.586489,90.432244
District,76.956733,80.966636,66.548453,80.799062,53.672208